{
    "common": {
        "name": "ve",
        "version": "0.3.0",
        "news": {
			"0.3.0": {
				"en": "Added writable variable in victron registers.\nAdded register 1052/TotalPower in victron registers.\nAdded more Grid registers (Voltage, Current, Energy fom net, Energy to net).\nAdded writable variable to createStateAsync() functions in main.js.\nFixed wrong registers for 'Battery Error'.\nAdded checks to create folders in 'Objects' for 'Battery', 'BatteryError', 'AC' and 'Grid'.",
				"de": "Hinzugefügt schreibbare Variable in victron Register.\nHinzugefügt Register 1052/TotalPower in victron Register.\nHinzu kommen Grid-Register (Voltage, Current, Energy fom net, Energy to net).\nHinzufügen von schreibbaren Variablen, umStateAsync() Funktionen in der Haupt. j).\nBehobene falsche Register für 'Battery Error'.\nEs wurden auch Ordner in Objekten für Batterie, BatteryError, AC und Grid erstellt.",
				"ru": "Добавлена переменная writable в victron реестры.\nДобавлена регистрация 1052/TotalPower в victron реестрах.\nДобавлены больше Grid реестров (Voltage, Current, Energy fom net, Energy to net).\nДобавлены параметры writable для созданияStateAsync() функции в главном. Джс.\nИсправлены неправильные реестры для 'Battery Error'.\nДобавлены проверки для создания папок в объектах для батареи, BatteryError, AC и Grid.",
				"pt": "Adicionado variável writable em registros victron.\nAdicionado registro 1052/TotalPower em registros victron.\nAdicionado mais Grid registra (Voltage, Current, Energy fom net, Energy to net).\nAdicionado variável writable para criarStateAsync() funções em principal. Js.\nRegistos errados corrigidos para 'Erro de bateria'.\nVerificações adicionadas para criar pastas em Objetos para Bateria, BatteryError, AC e Grade.",
				"nl": "Toegevoegd schrijfbaar variabel in vitron registers.\nGeregistreerd op naam van 1052/TotalPower in vitron registers.\nVoegde meer Grid registers toe. (Voltage, Current, Energy Fom net, Energie naar netten.\".\nToegevoegd schrijfbaar variabel om SStateAsync te creëren. Js.\nVerkeerde kentekens voor 'Battery Error'.\nToegevoegde cheques om folders te creëren in Objects voor Battery, BatteryError, AC en Grid.",
				"fr": "Ajout d'une variable écriture dans les registres victron.\nAjout du registre 1052/TotalPower dans les registres de victron.\nAjout d'autres registres Grid (Voltage, Current, Energy fom net, Energy to net).\nAjout de la variable writable pour créer des fonctionsStateAsync() dans main. js.\nCorrection de registres incorrects pour 'Battery Error'.\nAjout de vérifications pour créer des dossiers dans Objets pour Batterie, BatteryError, AC et Grid.",
				"it": "Aggiunto variabile writable in victron registri.\nAggiunto registro 1052/TotalPower in victron registri.\nAggiunti altri registri Grid (Voltage, Corrente, Energy fom net, Energy to net).\nAggiunto variabile scrivibile per creare funzioniStateAsync() in principale. j.\nRegistrati errati corretti per 'Errore di batteria'.\nAggiunti i controlli per creare cartelle in Oggetti per Batteria, BatteryError, AC e Grid.",
				"es": "Añadido variable writable in victron registers.\nRegistro 1052/TotalPower in victron registers.\nAñadido más Registros de Grid (Voltaje, corriente, red de fom de energía, energía a red).\nVariable adicional para crear funciones StateAsync() en principal. js.\nRegistros incorrectos fijos para 'Bloqueo de batería'.\nSe agregaron cheques para crear carpetas en objetos para batería, batería, aire acondicionado y rejilla.",
				"pl": "Added writable variable in the Victron registers (ang.).\nDodany rejestr 1052/TotalPower w rejestrach victronów.\nDodano więcej rejestrów Grid (Voltage, Current, Energy Fom net, Energy to net).\nAdded writable variable to tworzenie funkcjiStateAsync() w głównej mierze. js.\nFixed bad registers for ‘Battery Error’ (ang.).\nWstępne sprawdzanie tworzy foldery w Objects for Battery, BatteryError, AC i Grid.",
				"uk": "Додана змінна в реєстрах victron.\nДодано реєстрацію 1052/TotalPower в реєстрах victron.\nДодано більше Сітчастих реєстрів (Voltage, Current, Energy fom net, Energy to net).\nДодана writable змінна для створенняStateAsync() функції в основному. свінгери.\nВиправлено неправильні реєстри для \"Помилки\".\nДодано перевірки для створення папок в об'єктах для акумулятора, акумулятора, AC та Grid.",
				"zh-cn": "在天文登记册中增加可量化的变量。.\n在天体登记册中增列了1052/Totalios。.\n增加Grid登记册(目前、能源网、能源网和净能源)。.\n增加可量化的可变性,以产生主要国家阿森克()职能。 j.\n为Battery Error的错误登记册。.\n在Battery、BatteryError、AC 和Grid等物品上制造了手。."
              },
			"0.2.2": {
                "en": "Fixed 'check and lint' and integration test. Changed version in package.json and io-package.json\n",
				"de": "Behobener 'Check- und Lint'- und Integrationstest. Geänderte Version im Paket. json und io-package. Json\n",
				"ru": "Исправлена проверка и lint' и проверка интеграции. Изменена версия в пакете. json и io-package. Джсон\n",
				"pt": "Corrigido 'check e lint' e teste de integração. Versão alterada no pacote. json e io-package. O que foi\n",
				"nl": "Gerepareerd 'check and lint' en integratietest. Veranderde versie in pakket. Json en io-package. Json\n",
				"fr": "Correction 'check and lint' et le test d'intégration. Version modifiée dans le paquet. Json et io-package. json\n",
				"it": "Risolto \"check and lint\" e test di integrazione. Versione modificata nel pacchetto. json e io-package. J\n",
				"es": "Prueba de integración y control fijo. Versión modificada en paquete. json y io-package. json\n",
				"pl": "Fixed 'check and lint' and integration test. Wersja zmienna w pakiecie. json i io-package. json\n",
				"uk": "Виправлено 'check and lint' і тестування інтеграції. Змінена версія в пакеті. json і io-package. свінгери\n",
				"zh-cn": "固定的检查和标记以及一体化试验。 一揽子计划的修改版本。 json和碘。 json\n"
              },
            "0.2.1": {
                "en": "Added function with try...catch for receive inverter data",
                "de": "Zusatzfunktion mit Try...Katch für den Empfang von Wechselrichterdaten",
                "ru": "Добавлена функция с try...catch для получения инверторных данных",
                "pt": "Função adicionada com try...catch para receber dados do inversor",
                "nl": "Voeg de functie toe met een poging om inverter gegevens te ontvangen",
                "fr": "Fonction ajoutée avec essayer...catch pour recevoir des données d'inverter",
                "it": "Funzione aggiunta con provare...catch per ricevere dati inverter",
                "es": "Función agregada con el intento... capturar para recibir datos del inversor",
                "pl": "Funkcja dodawana do testu..catch za odwracanie danych",
                "uk": "Додано функцію з try...catch для отримання інверторних даних",
                "zh-cn": "增加工作功能。"
              },
            "0.2.0": {
                "en": "Process separate inverter object (multiple inverters) and write to data points. Updated \"Getestete Geräte\" in Readme. Inserted section \"configure\" in Readme. Updated io-package.json. ",
                "de": "Bearbeiten Sie separate Wechselrichterobjekt (mehrfache Wechselrichter) und schreiben Sie an Datenpunkte. Aktualisierte \"Getestete Geräte\" in Readme. Einfügen Abschnitt Konfigurieren in Readme. Aktualisierte io-package.json.",
                "ru": "Процесс отдельных инверторных объектов (много инверторов) и написать в пункты данных. Обновлено \"Getestete Geräte\" в Readme. Встроенная настройка раздела в Readme. Обновлен io-package.json.",
                "pt": "Processe o objeto inversor separado (versores múltiplos) e escreva para os pontos de dados. Atualizado \"Getestete Geräte\" em Readme. Seção inserida configurada no Readme. Atualizado io-package.json.",
                "nl": "Process apart inverter object (multiple inverters) en schrijf op data punten. Update \"Getestete Geräte\" in Readme. Geïnstrueerde sectie configuur in Readme. Upded io-package.",
                "fr": "Procéder à un objet d'invertisseur séparé (invertisseurs multiples) et écrire aux points de données. Actualisé \"Getestete Geräte\" à Readme. Configuration de section insérée dans Readme. Actualisé io-package.json.",
                "it": "Elaborare oggetto inverter separato (multiple inverter) e scrivere ai punti di dati. Aggiornato \"Getestete Geräte\" in Readme. Sezione inserita configurata in Readme. Aggiornato io-package.json.",
                "es": "Procesar un objeto inversor separado (invertores múltiples) y escribir a los puntos de datos. Actualizado \"Getestete Geräte\" en Readme. Configuración de sección insertada en Readme. Actualizado io-package.json.",
                "pl": "Proces odwrócenia odwrócenia (współczynnik wielokrotnych) i zapisywany na punkty danych. \"Getestete Geräte\" w Readme. Wykorzystywana sekcja jest w Readme. Wyd. io-package.json.",
                "uk": "Процес окремий інверторний об'єкт (багаторазові інвертори) і напишіть на точки даних. Оновлено \"Getestete Geräte\" в Readme. Вмонтований розділ, налаштовується в Readme. Оновлено io-package.json.",
                "zh-cn": "处理不同的物体(纵火器)并填写数据点。 阅读摘要中更新的“Getestete Geräte”。 编页图。 最新包装."
              },
            "0.1.1": {
                "en": "Changed inverter register to a seperate object to use multiple PV-Inverters. Added textbox in UI to set a count of PV-Inverters.",
                "de": "Wechseln Sie das Wechselrichterregister in ein seperate Objekt, um mehrere PV-Inverter zu verwenden. Textfeld in UI hinzugefügt, um eine Anzahl von PV-Invertern einzustellen.",
                "ru": "Изменена инверторная регистрация на сеператый объект для использования нескольких PV-инверторов. Добавлен текстовый ящик в UI для установки количества PV-инверторов.",
                "pt": "Registro do inversor alterado para um objeto seperado para usar vários PV-Inverters. Adicionado caixa de texto em UI para definir uma contagem de PV-Inverters.",
                "nl": "Veranderde inverter register naar een seperaat object om meerdere PV-Inverters te gebruiken. Gevoegd in UI om een aantal PV-Inverters te tellen.",
                "fr": "Changed inverter register to a seperate object to use multiple PV-Inverters. Ajout de la boîte de texte dans l'interface utilisateur pour définir un nombre de PV-Inverters.",
                "it": "Cambiato registro inverter a un oggetto seperato per utilizzare più PV-Inverter. Aggiunta casella di testo in UI per impostare un conteggio di PV-Inverters.",
                "es": "Cambia el registro de inversor a un objeto seperado para utilizar múltiples PV-Inverters. Se agregó un buzón de texto en UI para establecer un recuento de inversores PV.",
                "pl": "Zmienił rejestratora na szeroki obiekt, aby użyć wielu zmiennych PV-Inverters. Added textbox in UI to set the count of PV-Inverters.",
                "uk": "Змінений інверторний реєстр для seperate об'єкта для використання декількох PV-інверторів. Додано текстову скриньку в UI для встановлення кількості PV-Інверторів.",
                "zh-cn": "不同地点的登记册有变化,目的在于使用多种电网。 在UI中增加案文箱,以建立光纤器。."
            },
            "0.1.0": {
                "en": "First running version, Added Registers, Added more registers",
                "de": "Erste Ausführung, Hinzugefügt Register, Hinzugefügt mehr Register",
                "ru": "Первая версия, Добавленные Регистры, Добавлены больше регистров",
                "pt": "Primeira versão em execução, Registos adicionados, Adicionado mais registros",
                "nl": "Eerste draaiende versie, Added Registers, voegde meer registers toe",
                "fr": "Première version en cours, Ajout de registres, Ajout d'autres registres",
                "it": "Prima versione in esecuzione, Aggiunto Registrati, Aggiunto più registri",
                "es": "Primera versión en ejecución, Registros añadidos, Añadido más registros",
                "pl": "Pierwsza wersja, Added Registers, zawiera więcej rejestrów",
                "uk": "Перший запуск версії, Додано реєстри, Додано більше реєстрів",
                "zh-cn": "第一版,《增编登记册》,增加登记册"
            },
            "0.0.1": {
                "en": "initial release",
                "de": "Erstveröffentlichung",
                "ru": "Начальная версия",
                "pt": "lançamento inicial",
                "nl": "Eerste uitgave",
                "fr": "Première version",
                "it": "Versione iniziale",
                "es": "Versión inicial",
                "pl": "Pierwsze wydanie",
                "zh-cn": "首次出版",
                "uk": "початковий випуск"
            }
        },
        "title": "Victron Energy",
        "titleLang": {
            "en": "Victron Energy",
            "de": "Victron Energie",
            "ru": "Виктрон Энерджи",
            "pt": "Victron Energy",
            "nl": "Victron energie",
            "fr": "Victron Énergie",
            "it": "Victron Energy",
            "es": "Energía victron",
            "pl": "Energia Victrona",
            "zh-cn": "伟创能源",
            "uk": "Victron Energy"
        },
        "desc": {
            "en": "ve",
            "de": "ve",
            "ru": "ве",
            "pt": "eu",
            "nl": "ve",
            "fr": "je",
            "it": "ve",
            "es": "ve",
            "pl": "ve",
            "zh-cn": "已经",
            "uk": "ve"
        },
        "authors": [
            "derAlff <deralff@gmail.com>"
        ],
        "keywords": [
            "ioBroker",
            "template",
            "Smart Home",
            "home automation"
        ],
        "license": "CC BY-NC 4.0",
        "platform": "Javascript/Node.js",
        "main": "main.js",
        "icon": "ve.png",
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/derAlff/ioBroker.ve/main/admin/ve.png",
        "readme": "https://github.com/derAlff/ioBroker.ve/blob/main/README.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "iot-systems",
        "compact": true,
        "connectionType": "local",
        "dataSource": "poll",
        "adminUI": {
            "config": "json"
        },
        "dependencies": [
            {
                "js-controller": ">=3.3.22"
            }
        ],
        "globalDependencies": [
            {
                "admin": ">=5.1.13"
            }
        ]
    },
    "native": {
        "victronIp": "",
        "victronPort": 502,
        "useMqtt": false,
        "fetchInterval": 5000,
        "numOfPvInverters": 0
    },
    "objects": [],
    "instanceObjects": []
}
